{
  "name": "Pat Fosse",
  "image": "/uploads/team/board/pat-fosse-1.JPG",
  "blurb": "Teaching and mentoring youth has always been a priority for Pat. She has hired and mentored over 200 permanent and/or seasonal employees during her 28 years as a supervisor with the BLM. ",
  "bio": "I grew up on a ranch in western North Dakota, where I gained a practical education and learned how to work in a team setting with two sisters and two brothers.\nI received a Bachelor of Science degree in Range Management from the School of Forestry, University of Montana. \nI worked for the BLM for 35 years (1987-2022) in two different field offices (Fillmore, Utah and Dillon, Mt).  I retired in 2022.\nMy husband and I have two very successful grown children and two grandchildren. \n\nEmployment:\n2022-2024:\tRetired, working on Flexible Grazing Project with SW MT Sagebrush Partnership, adjunct professor for UM-Western, several volunteer activities.\n2006-2022:\tAssistant Field Manager, Renewable Resources, BLM Dillon Field Office\t\n2001 - 2005:\tSupervisory Rangeland Management Specialist, BLM Dillon Field Office\n1994 - 2001:\tAssistant Field Manager, BLM Fillmore Field Office, Fillmore, Utah\n1987 - 1994:\tRangeland Management Specialist, BLM Fillmore Field Office\n\nPrimary Accomplishments/Impacts:\n    • I instituted the holistic watershed assessment process currently used by the Dillon Field Office to assess, manage and improve the public lands administered by the Dillon Field Office. I actively participated in all the watershed assessments from 2002 - 2022 (33 watershed assessments). This has been a very efficient and effective process to work with public land users and partners in the management of the public lands in SW Montana and accomplish work on the ground.  \n    • Teaching and mentoring youth has always been a priority for me. I hired and mentored over 200 permanent and/or seasonal employees during my 28 years as a supervisor with the BLM.  I participated in youth conservation day every year, Montana Range days in Dillon, and any other opportunity to teach/mentor youth. Since retiring, I have taught a couple of classes at UM-Western (Range Management and Ag. Science-Plants) and have volunteered for the YEP Board, Youth Conservation Day and Church Council.  ",
  "_template": "board"
}