{
  "active": true,
  "title": "Crew Lead (18 years or older)",
  "image": "/uploads/PXL_20230720_170352420.jpg",
  "body": "The Crew Lead is tasked with assembling and nurturing an effective team capable of completing projects independently, leveraging resources from YEP management and technical expertise from partners. The crew lead is responsible for teaching and using chainsaws, tablets with software for mapping, and chemical spraying to treat weeds. Must be willing to accomplish preparation work tasks when needed.\n\nKey Responsibilities:\n\n1. Team Management:\n2. Organization and Preparation:\n3. Safety and Professional Ethics:\n4. Communication:\n5. Documentation and Reporting:\n6. Performance Reviews:\n7. Tool and Equipment Management:\n8. Training and Development:\n9. Project Goals and Adaptability:\n10. Engagement and Positivity:\n11. Responsibility and Professionalism:\n\nConclusion\n\nAs a Crew Lead, your role is pivotal in ensuring the team's success through effective management, clear communication, and a commitment to safety and professionalism. Embrace the opportunity to lead, support, and develop your crew, fostering an environment where everyone can thrive and enjoy their work.\n\nTHE MINIMUM REQUIRED EDUCATION AND EXPERIENCE:\n\n* Minimum age of 18 years, 22 years of age is preferred.\n* Experience working outside.\n* 2 years of University experience in natural resources is preferred \n* Experience managing employees, teams and/or equipment.\n* Positive energy, can do attitude\n* Positive verbal and writing communication skill \n* Athletic  hard working ability\n* Interest in learning and expanding professionally capacity \n* The ability to lift 40 lbs\n* This position may require periodic overnight travel and non-traditional work hours, including occasional weekend and evening hours, often camping in a tent for up to 8 days at a time. \n* Hiking in rugged terrain up to 10 miles per day\n* Reasonable accommodations may be made for qualified individuals with disabilities if they can perform the essential functions of the position.\n\nWhile this position description describes the general nature and level of work being performed by people assigned to this position, it is not an exhaustive list of all responsibilities, duties, and skills desired. All Youth Employment Program positions may require duties outside of normal responsibilities. YEP is an Equal-Opportunity Employer and is excited to diversify our management team.\n",
  "link": "https://forms.gle/kaso7SaJBH5LpmY69",
  "branch": "",
  "_template": "seasonal"
}