{
  "active": true,
  "title": "Crew Member(18 years or older)",
  "image": "/uploads/PXL_20230801_212114218.jpg",
  "brief": "Assistant crew lead is crucial in fostering a productive and supportive environment for the crew, enabling them to work autonomously while effectively accomplishing their tasks.",
  "body": "Assistant crew lead is crucial in fostering a productive and supportive environment for the crew, enabling them to work autonomously while effectively accomplishing their tasks. Here are the key responsibilities and goals for the position:\n\n1\\. Support and Leadership: Assist the crew lead in creating a positive and productive atmosphere. Your role involves motivating crew members, helping them grow professionally, and ensuring they feel connected and supported.\n\n2\\. Teamwork and Communication: Work collaboratively with colleagues, addressing challenges with trust and open communication. Maintain a positive relationship with the YEP team and partners to achieve common goals. We always try to resolve problems within our organization first.  When partners ask how things are going we always say excellent! Because you know that if there is a problem our organization listens to you and works to solve the problem!\n\n3\\. Safety and Professionalism: Prioritize safety in all job tasks, adhering to professional ethics and ensuring the crew follows best practices. Regularly check tools and equipment, reporting any damages promptly. Adheres to YEP policies that are in place.\n\n4\\. Project Organization: Help organize resources and logistics for projects, ensuring that all necessary elements are in place to complete tasks efficiently and safely.\n\n5\\. Continuous Learning and Adaptability: Be open to changes in work and project expectations. Encourage a culture of learning and positivity, making the workday enjoyable through humor and creativity. Study of techniques both during work hours and after hours.\n\n6\\. Goal Setting: Develop small, achievable goals for the crew to enhance effectiveness and celebrate successes. Adjust expectations based on experiences and outcomes.\n\n7\\. Engagement with Partners: Regularly check in with on-site partners to maintain quality control and satisfaction, as they are key stakeholders.\n\n8\\. Fun and Professionalism: Foster a work environment that values fun and professional pride. Encourages each other to take on leadership roles with volunteers and support each other's development.\n\n9\\. Project Responsibilities: Be prepared for various projects in 2024, such as animal-friendly fencing, trail building, conifer reduction, riparian projects, and conservation building, which require physical endurance and teamwork. \n\nBy embodying these principles, each crew member can significantly contribute to the crew's success and ensure a fulfilling experience for everyone involved.\n\nTHE MINIMUM REQUIRED EDUCATION AND EXPERIENCE:\n\n* Minimum age of 15\n* On-time\n* Positive attitude\n* Continually learning\n* Ability to follow the YEP employee handbook \n* Ability to take direction easily\n* Interest in developing professional characteristics\n* Interest and/or experience working outside \n* Ability to work as a team member\n* The ability to lift 40 lbs\n* This position may require periodic overnight travel and non-traditional work hours, including occasional weekend and evening hours, often camping in a tent for up to 8 days at a time. \n* Hiking in rugged terrain up to 10 miles per day\n* Reasonable accommodations may be made for qualified individuals with disabilities if they can perform the essential functions of the position.\n\nWhile this position description describes the general nature and level of work being performed by people assigned to this position, it is not an exhaustive list of all responsibilities, duties, and skills desired. All Youth Employment Program positions may require duties outside of normal responsibilities. YEP is an Equal-Opportunity Employer and is excited to diversify our management team.\n",
  "link": "https://docs.google.com/forms/d/e/1FAIpQLScrax8QKA0lKjl2TdRaXRkWMBrWd-6H3To-tDw410JwiN6nUg/viewform",
  "branch": "content/contact/Dillon.json",
  "_template": "seasonal"
}