{
  "title": "Project Coordinator",
  "image": "/uploads/PXL_20230621_170930297.jpg",
  "body": "## Based in Dillon, this position supports the Youth Employment Program across all locations. Coordinated efforts with Salmon staff are crucial. The role requires independent system building and implementation. The main goals include personnel, equipment, and project completion. This field-based position from mid-April to September involves camping and physically demanding work. The PC reports to the Program Manager.\n",
  "responsibilities": "* Communicate with understanding to all crews and crew leads. The goal is to motivate them to reach YEP goals in a positive manner. Set small goals with crews every day.\n* PC is responsible for implementing corrective procedures for personnel (three strike rule) in coordination with the PM.\n* Serve as the safety officer for all crews. Implement operational strategies to keep crews safe, efficient, and effective.\n* Delegate tasks to crew leads and crews.\n* Schedule labor, equipment, tools, materials, and supportive information to meet the project's needs. Communicate this schedule to YEP personnel and partners.\n* Create personnel files/folders for all new hires, including mentor/job evaluations.\n* Mentor crew leads to develop positive and strong relationships with their crew.\n* Ensure that partners' project objectives are met.\n* Recruit employees from high schools and Universities throughout the High Divide region. This will involve extensive travel from February through May.\n* Perform interviews, background checks, and write letters of recommendation. hire employees and develop and put together crews.\n* Keep PM and ED informed of progress and issues with the crew.\n* Complete on-boarding for all new employees.\n* Participate in board meetings.\n* Work with YEP staff to maintain and update all policies and procedures manuals.\n* Monitor employees to give early constructive feedback to mitigate conflict or mistakes.\n* Work with employees to develop efficacy as well as efficient workflow patterns.\n* Create policies that help retention of employees.\n* Work with the area High Schools and Universities to identify staff who could assist in promoting YEP’s recruitment of high school—and college-aged individuals.\n* Assist the Program Manager by learning and assisting in his/her position, such as task orders, contracts, agreements, performance reports, scheduling, building systems, and establishing relationships with partners.\n* Do the Program Manager position to resolve YEP conflicts of Interest, “BDFS Botany”\n* Track employee satisfaction and help influence policy and support required to meet targets created.\n* Analyze and communicate to PM risks and opportunities for YEP.\n* Develop trust and communication among crews and crew members by being fair, honest, and following through with compliments.\n* Enforce and execute daily tool checks, weekly tool reports, and monthly equipment checklists.\n* Enforce and execute protocols to ensure crews are prepared for each work project so they can work effectively.\n* Review employee's performance and behavior at the end of June and the end of the field season.\n* Discuss and document employee 5-year goals and fill out mentor sheets.\n* Develop and maintain project performance information that tracks project progress and completion.\n* Assign and monitor resources effectively to boost project efficacy and maximize quality project work and completion.\n* Strengthen partnerships with partners, donors, current staff, and former employees.\n* Build and update social media (Facebook, Instagram and YEP website)\n* Create an annual newsletter in the fall as part of outreach initiatives\n* Oversee on-boarding, recruitment & retention of seasonal crews and crew leads\n* Enroll and track employees through the pipeline program.\n",
  "link": "https://docs.google.com/forms/d/1U4Ii2AzFAjuLva5PLdESL9jy4Y40E1Ry6Xy139cDtXc",
  "branch": "content/contact/Dillon.json",
  "_template": "fulltime"
}